rails-intro/app/controllers/movies_controller.rb

	def index
		@all_ratings = Movie.all_ratings
		filters = []
		sort_type = params[:index]
		if not params[:ratings] then
			flash.keep
			redirect_to movies_path(:ratings => session[:ratings], :index => params[:index])
		else
			params[:ratings].each do |rating, value| filters.append(rating) end
			if not sort_type then sort_type = session[:index] end
			@movies = Movie.order(sort_type).where({rating: filters})
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY title

	def create
		@movie = Movie.create!(params[:movie])
---
INSERT INTO "movies" ("description", "rating", "release_date", "title") VALUES (?, ?, ?, ?)  [["description", nil], ["rating", "G"], ["release_date", Sun, 15 Feb 2015 00:00:00 UTC +00:00], ["title", "yolo420swagblazeit"]]

	def update
		@movie = Movie.find params[:id]
		@movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "10"]]
UPDATE "movies" SET "director" = 'yolo' WHERE "movies"."id" = 10

	def find_by_director
		@movie = Movie.find(params[:id])
		if (not @movie.director) || (@movie.director.length < 1) then
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "10"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'yolo' LIMIT 1